RG22EM/HAMDUINO/avr/boards.txt
88.menu.clock.1MHz_external=External 1 MHz
88.menu.clock.1MHz_external.upload.speed=9600
88.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
88.menu.clock.1MHz_external.build.clkpr=
88.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
88.menu.clock.1MHz_external.build.f_cpu=1000000L

88.menu.clock.8MHz_internal=Internal 8 MHz
88.menu.clock.8MHz_internal.upload.speed=38400
88.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.8MHz_internal.build.clkpr=
88.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
88.menu.clock.8MHz_internal.build.f_cpu=8000000L

88.menu.clock.4MHz_internal=Internal 4 MHz
88.menu.clock.4MHz_internal.upload.speed=9600
88.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
88.menu.clock.4MHz_internal.build.clock_speed=8000000L
88.menu.clock.4MHz_internal.build.f_cpu=4000000L

88.menu.clock.2MHz_internal=Internal 2 MHz
88.menu.clock.2MHz_internal.upload.speed=9600
88.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
88.menu.clock.2MHz_internal.build.clock_speed=8000000L
88.menu.clock.2MHz_internal.build.f_cpu=2000000L

88.menu.clock.1MHz_internal=Internal 1 MHz
88.menu.clock.1MHz_internal.upload.speed=9600
88.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
88.menu.clock.1MHz_internal.build.clkpr=
88.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
88.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################
#### ATmega48/A/P/PA/PB ####
############################

# General
48.name=HAMDUINO-48PB
48.upload.tool=avrdude
48.upload.using=avrdude
48.upload.maximum_size=4096
48.upload.maximum_data_size=512
48.bootloader.tool=avrdude
48.bootloader.unlock_bits=0x3f
48.bootloader.lock_bits=0x3f
48.bootloader.extended_fuses=0xff
48.build.core=MCUdude_corefiles
48.build.board=AVR_ATmega48
48.build.bootloader_led=B5
48.build.extra_flags={build.clkpr}

# Bootloader select
48.menu.bootloader.no_bootloader=No bootloader
48.menu.bootloader.no_bootloader.upload.maximum_size=4096
48.menu.bootloader.no_bootloader.build.export_merged_output=false
48.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
48.menu.eeprom.keep=EEPROM retained
48.menu.eeprom.keep.bootloader.eesave_bit=0
48.menu.eeprom.erase=EEPROM not retained
48.menu.eeprom.erase.bootloader.eesave_bit=1

# Variants
48.menu.variant.modelPB=48PB
48.menu.variant.modelPB.bootloader.cksel_bits=1111
48.menu.variant.modelPB.build.variant=pb-variant
48.menu.variant.modelPB.build.mcu=atmega48pb

# Brown out detection
48.menu.BOD.2v7=BOD 2.7V
48.menu.BOD.2v7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}101
48.menu.BOD.4v3=BOD 4.3V
48.menu.BOD.4v3.bootloader.high_fuses=0b1101{bootloader.eesave_bit}100
48.menu.BOD.1v8=BOD 1.8V
48.menu.BOD.1v8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}110
48.menu.BOD.disabled=BOD Disabled
48.menu.BOD.disabled.bootloader.high_fuses=0b1101{bootloader.eesave_bit}111

# Compiler link time optimization
48.menu.LTO.Os=LTO disabled
48.menu.LTO.Os.compiler.c.extra_flags=
48.menu.LTO.Os.compiler.c.elf.extra_flags=
48.menu.LTO.Os.compiler.cpp.extra_flags=
48.menu.LTO.Os.ltoarcmd=avr-ar

48.menu.LTO.Os_flto=LTO enabled
48.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
48.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
48.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
48.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
48.menu.clock.16MHz_external=External 16 MHz
48.menu.clock.16MHz_external.upload.speed=115200
48.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.16MHz_external.build.clkpr=
48.menu.clock.16MHz_external.build.f_cpu=16000000L

48.menu.clock.20MHz_external=External 20 MHz
48.menu.clock.20MHz_external.upload.speed=115200
48.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.20MHz_external.build.clkpr=
48.menu.clock.20MHz_external.build.f_cpu=20000000L

48.menu.clock.18_432MHz_external=External 18.432 MHz
48.menu.clock.18_432MHz_external.upload.speed=115200
48.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.18_432MHz_external.build.clkpr=
48.menu.clock.18_432MHz_external.build.f_cpu=18432000L

48.menu.clock.14_7456MHz_external=External 14.7456 MHz
48.menu.clock.14_7456MHz_external.upload.speed=115200
48.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.14_7456MHz_external.build.clkpr=
48.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

48.menu.clock.12MHz_external=External 12 MHz
48.menu.clock.12MHz_external.upload.speed=57600
48.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.12MHz_external.build.clkpr=
48.menu.clock.12MHz_external.build.f_cpu=12000000L

48.menu.clock.11_0592MHz_external=External 11.0592 MHz
48.menu.clock.11_0592MHz_external.upload.speed=115200
48.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.11_0592MHz_external.build.clkpr=
48.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

48.menu.clock.8MHz_external=External 8 MHz
48.menu.clock.8MHz_external.upload.speed=57600
48.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.8MHz_external.build.clkpr=
48.menu.clock.8MHz_external.build.f_cpu=8000000L

48.menu.clock.7_3728MHz_external=External 7.3728 MHz
48.menu.clock.7_3728MHz_external.upload.speed=115200
48.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.7_3728MHz_external.build.clkpr=
48.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

48.menu.clock.4MHz_external=External 4 MHz
48.menu.clock.4MHz_external.upload.speed=9600
48.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.4MHz_external.build.clkpr=
48.menu.clock.4MHz_external.build.f_cpu=4000000L

48.menu.clock.3_6864MHz_external=External 3.6864 MHz
48.menu.clock.3_6864MHz_external.upload.speed=115200
48.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.3_6864MHz_external.build.clkpr=
48.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

48.menu.clock.2MHz_external=External 2 MHz
48.menu.clock.2MHz_external.upload.speed=9600
48.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.2MHz_external.build.clkpr=
48.menu.clock.2MHz_external.build.f_cpu=2000000L

48.menu.clock.1_8432MHz_external=External 1.8432 MHz
48.menu.clock.1_8432MHz_external.upload.speed=115200
48.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.1_8432MHz_external.build.clkpr=
48.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

48.menu.clock.1MHz_external=External 1 MHz
48.menu.clock.1MHz_external.upload.speed=9600
48.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
48.menu.clock.1MHz_external.build.clkpr=
48.menu.clock.1MHz_external.build.f_cpu=1000000L

48.menu.clock.8MHz_internal=Internal 8 MHz
48.menu.clock.8MHz_internal.upload.speed=38400
48.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.8MHz_internal.build.clkpr=
48.menu.clock.8MHz_internal.build.f_cpu=8000000L

48.menu.clock.4MHz_internal=Internal 4 MHz
48.menu.clock.4MHz_internal.upload.speed=9600
48.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
48.menu.clock.4MHz_internal.build.f_cpu=4000000L

48.menu.clock.2MHz_internal=Internal 2 MHz
48.menu.clock.2MHz_internal.upload.speed=9600
48.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
48.menu.clock.2MHz_internal.build.f_cpu=2000000L

48.menu.clock.1MHz_internal=Internal 1 MHz
48.menu.clock.1MHz_internal.upload.speed=9600
48.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
48.menu.clock.1MHz_internal.build.clkpr=
48.menu.clock.1MHz_internal.build.f_cpu=1000000L


